sechshelme/Lazarus-Embedded/Tools/AVR_XML_to_Fuse_Const/XML/Atmel.ATmega_DFP.2.0.401.atpack_FILES/atdf/AT90PWM3.atdf
      <value-group name="ENUM_BOOTSZ">
        <value caption="Boot Flash size=128 words Boot address=$0F80" name="128W_0F80" value="0x03"/>
        <value caption="Boot Flash size=256 words Boot address=$0F00" name="256W_0F00" value="0x02"/>
        <value caption="Boot Flash size=512 words Boot address=$0E00" name="512W_0E00" value="0x01"/>
        <value caption="Boot Flash size=1024 words Boot address=$0C00" name="1024W_0C00" value="0x00"/>
      </value-group>
    </module>
    <module caption="Lockbits" name="LOCKBIT">
      <register-group caption="Lockbits" name="LOCKBIT">
        <register name="LOCKBIT" offset="0x00" size="1" initval="0xFF">
          <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
          <bitfield caption="Boot Loader Protection Mode" mask="0x0C" name="BLB0" values="ENUM_BLB"/>
          <bitfield caption="Boot Loader Protection Mode" mask="0x30" name="BLB1" values="ENUM_BLB2"/>
        </register>
      </register-group>
      <value-group name="ENUM_LB">
        <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
        <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
        <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
      </value-group>
      <value-group name="ENUM_BLB">
        <value caption="LPM and SPM prohibited in Application Section" name="LPM_SPM_DISABLE" value="0x00"/>
        <value caption="LPM prohibited in Application Section" name="LPM_DISABLE" value="0x01"/>
        <value caption="SPM prohibited in Application Section" name="SPM_DISABLE" value="0x02"/>
        <value caption="No lock on SPM and LPM in Application Section" name="NO_LOCK" value="0x03"/>
      </value-group>
      <value-group name="ENUM_BLB2">
        <value caption="LPM and SPM prohibited in Boot Section" name="LPM_SPM_DISABLE" value="0x00"/>
        <value caption="LPM prohibited in Boot Section" name="LPM_DISABLE" value="0x01"/>
        <value caption="SPM prohibited in Boot Section" name="SPM_DISABLE" value="0x02"/>
        <value caption="No lock on SPM and LPM in Boot Section" name="NO_LOCK" value="0x03"/>
      </value-group>
    </module>
    <module caption="I/O Port" name="PORT">
      <register-group caption="I/O Port" name="PORTB">
        <register caption="Port B Data Register" name="PORTB" offset="0x25" size="1" mask="0xFF"/>
        <register caption="Port B Data Direction Register" name="DDRB" offset="0x24" size="1" mask="0xFF"/>
        <register caption="Port B Input Pins" name="PINB" offset="0x23" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTC">
        <register caption="Port C Data Register" name="PORTC" offset="0x28" size="1" mask="0xFF"/>
        <register caption="Port C Data Direction Register" name="DDRC" offset="0x27" size="1" mask="0xFF"/>
        <register caption="Port C Input Pins" name="PINC" offset="0x26" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTD">
        <register caption="Port D Data Register" name="PORTD" offset="0x2B" size="1" mask="0xFF"/>
        <register caption="Port D Data Direction Register" name="DDRD" offset="0x2A" size="1" mask="0xFF"/>
        <register caption="Port D Input Pins" name="PIND" offset="0x29" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTE">
        <register caption="Port E Data Register" name="PORTE" offset="0x2E" size="1" mask="0x07"/>
        <register caption="Port E Data Direction Register" name="DDRE" offset="0x2D" size="1" mask="0x07"/>
        <register caption="Port E Input Pins" name="PINE" offset="0x2C" size="1" mask="0x07" ocd-rw="R"/>
      </register-group>
    </module>
    <module caption="Bootloader" name="BOOT_LOAD">
      <register-group caption="Bootloader" name="BOOT_LOAD">
        <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
          <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
          <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
          <bitfield caption="Read While Write section read enable" mask="0x10" name="RWWSRE"/>
          <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
      </register-group>
    </module>
    <module caption="Extended USART" name="EUSART">
      <register-group caption="Extended USART" name="EUSART">
        <register caption="EUSART I/O Data Register" name="EUDR" offset="0xCE" size="1" mask="0xFF" ocd-rw="">
          <bitfield caption="EUSART Extended data bits" mask="0xFF" name="EUDR"/>
        </register>
        <register caption="EUSART Control and Status Register A" name="EUCSRA" offset="0xC8" size="1">
          <bitfield caption="EUSART Control and Status Register A Bits" mask="0xF0" name="UTxS" values="COMM_TRANS_CHAR_SIZE"/>
          <bitfield caption="EUSART Control and Status Register A Bits" mask="0x0F" name="URxS" values="COMM_TRANS_CHAR_SIZE2"/>
        </register>
        <register caption="EUSART Control Register B" name="EUCSRB" offset="0xC9" size="1">
          <bitfield caption="EUSART Enable Bit" mask="0x10" name="EUSART"/>
          <bitfield caption="EUSBS Enable Bit" mask="0x08" name="EUSBS"/>
          <bitfield caption="Manchester Mode Bit" mask="0x02" name="EMCH"/>
          <bitfield caption="Order Bit" mask="0x01" name="BODR"/>
        </register>
        <register caption="EUSART Status Register C" name="EUCSRC" offset="0xCA" size="1" ocd-rw="R">
          <bitfield caption="Frame Error Manchester Bit" mask="0x08" name="FEM"/>
          <bitfield caption="F1617 Bit" mask="0x04" name="F1617"/>
          <bitfield caption="Stop Bits" mask="0x03" name="STP"/>
        </register>
        <register caption="Manchester Receiver Baud Rate Register" name="MUBRR" offset="0xCC" size="2">
          <bitfield caption="Manchester Receiver Baud Rate Register Bits" mask="0xFFFF" name="MUBRR"/>
        </register>
      </register-group>
      <value-group name="COMM_TRANS_CHAR_SIZE">
        <value caption="5-bit" name="5_BIT" value="0x00"/>
        <value caption="6-bit" name="6_BIT" value="0x01"/>
        <value caption="7-bit" name="7_BIT" value="0x02"/>
        <value caption="8-bit" name="8_BIT" value="0x03"/>
        <value caption="Reserved" name="RESERVED" value="0x04"/>
        <value caption="Reserved" name="RESERVED" value="0x05"/>
        <value caption="Reserved" name="RESERVED" value="0x06"/>
        <value caption="9-bit" name="9_BIT" value="0x07"/>
        <value caption="13-bit" name="13_BIT" value="0x08"/>
        <value caption="14-bit" name="14_BIT" value="0x09"/>
        <value caption="15-bit" name="15_BIT" value="0x0A"/>
        <value caption="16-bit" name="16_BIT" value="0x0B"/>
        <value caption="Reserved" name="RESERVED" value="0x0C"/>
        <value caption="Reserved" name="RESERVED" value="0x0D"/>
        <value caption="Reserved" name="RESERVED" value="0x0E"/>
        <value caption="17-bit" name="17_BIT" value="0x0F"/>
      </value-group>
