sechshelme/Lazarus-Embedded/Tools/AVR_XML_to_Fuse_Const/XML/Atmel.ATmega_DFP.2.0.401.atpack_FILES/atdf/AT90PWM3.atdf
        <register caption="ADC Data Register Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF">
          <bitfield caption="ADC Data Register" mask="0xFFFF" name="ADC"/>
        </register>
        <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
          <bitfield caption="ADC High Speed Mode" mask="0x80" name="ADHSM"/>
          <bitfield caption="Amplified Channel Start Conversion" mask="0x10" name="ADASCR"/>
          <bitfield caption="ADC Auto Trigger Source" mask="0x0F" name="ADTS"/>
        </register>
        <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x7E" size="1" mask="0xFF">
          <bitfield mask="0x80" name="ADC7D"/>
          <bitfield mask="0x40" name="ADC6D"/>
          <bitfield mask="0x20" name="ADC5D"/>
          <bitfield mask="0x10" name="ADC4D"/>
          <bitfield mask="0x08" name="ADC3D"/>
          <bitfield mask="0x04" name="ADC2D"/>
          <bitfield mask="0x02" name="ADC1D"/>
          <bitfield mask="0x01" name="ADC0D"/>
        </register>
        <register caption="Digital Input Disable Register 1" name="DIDR1" offset="0x7F" size="1">
          <bitfield mask="0x20" name="ACMP0D"/>
          <bitfield mask="0x10" name="AMP0PD"/>
          <bitfield mask="0x08" name="AMP0ND"/>
          <bitfield mask="0x04" name="ADC10D"/>
          <bitfield mask="0x02" name="ADC9D"/>
          <bitfield mask="0x01" name="ADC8D"/>
        </register>
        <register name="AMP0CSR" offset="0x76" size="1">
          <bitfield mask="0x80" name="AMP0EN"/>
          <bitfield mask="0x40" name="AMP0IS"/>
          <bitfield mask="0x30" name="AMP0G"/>
          <bitfield mask="0x03" name="AMP0TS"/>
        </register>
        <register name="AMP1CSR" offset="0x77" size="1">
          <bitfield mask="0x80" name="AMP1EN"/>
          <bitfield mask="0x40" name="AMP1IS"/>
          <bitfield mask="0x30" name="AMP1G"/>
          <bitfield mask="0x03" name="AMP1TS"/>
        </register>
      </register-group>
      <value-group name="ANALOG_ADC_V_REF2">
        <value caption="AREF, Internal Vref turned off" name="AREF_INTERNAL_VREF_TURNED_OFF" value="0x00"/>
        <value caption="AVCC with external capacitor at AREF pin" name="AVCC_WITH_EXTERNAL_CAPACITOR_AT_AREF_PIN" value="0x01"/>
        <value caption="Reserved" name="RESERVED" value="0x02"/>
        <value caption="Internal 2.56V Voltage Reference with external capacitor at AREF pin" name="INTERNAL_2_56V_VOLTAGE_REFERENCE_WITH_EXTERNAL_CAPACITOR_AT_AREF_PIN" value="0x03"/>
      </value-group>
    </module>
    <module caption="USART" name="USART">
      <register-group caption="USART" name="USART">
        <register caption="USART I/O Data Register" name="UDR" offset="0xC6" size="1" ocd-rw="">
          <bitfield caption="USART I/O Data" mask="0xFF" name="UDR"/>
        </register>
        <register caption="USART Control and Status register A" name="UCSRA" offset="0xC0" size="1" ocd-rw="R">
          <bitfield caption="USART Receive Complete" mask="0x80" name="RXC"/>
          <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC"/>
          <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE"/>
          <bitfield caption="Framing Error" mask="0x10" name="FE"/>
          <bitfield caption="Data Overrun" mask="0x08" name="DOR"/>
          <bitfield caption="USART Parity Error" mask="0x04" name="UPE"/>
          <bitfield caption="Double USART Transmission Bit" mask="0x02" name="U2X"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM"/>
        </register>
        <register caption="USART Control an Status register B" name="UCSRB" offset="0xC1" size="1">
          <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE"/>
          <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE"/>
          <bitfield caption="USART Data Register Empty Interrupt Enable" mask="0x20" name="UDRIE"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN"/>
          <bitfield caption="Character Size" mask="0x04" name="UCSZ2"/>
          <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB8"/>
          <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB8"/>
        </register>
        <register caption="USART Control an Status register C" name="UCSRC" offset="0xC2" size="1">
          <bitfield caption="USART Mode Select" mask="0x40" name="UMSEL0"/>
          <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size Bits" mask="0x06" name="UCSZ"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL"/>
        </register>
        <register caption="USART Baud Rate Register" name="UBRR" offset="0xC4" size="2">
          <bitfield caption="USART Baud Rate Register Bits" mask="0x0FFF" name="UBRR"/>
        </register>
      </register-group>
      <value-group name="COMM_UPM_PARITY_MODE">
        <value caption="Disabled" name="DISABLED" value="0x00"/>
        <value caption="Reserved" name="RESERVED" value="0x01"/>
        <value caption="Enabled, Even Parity" name="ENABLED_EVEN_PARITY" value="0x02"/>
        <value caption="Enabled, Odd Parity" name="ENABLED_ODD_PARITY" value="0x03"/>
      </value-group>
      <value-group name="COMM_STOP_BIT_SEL">
        <value caption="1-bit" name="1_BIT" value="0x00"/>
        <value caption="2-bit" name="2_BIT" value="0x01"/>
      </value-group>
    </module>
    <module caption="Serial Peripheral Interface" name="SPI">
      <register-group caption="Serial Peripheral Interface" name="SPI">
        <register caption="SPI Control Register" name="SPCR" offset="0x4C" size="1">
          <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE"/>
          <bitfield caption="SPI Enable" mask="0x40" name="SPE"/>
          <bitfield caption="Data Order" mask="0x20" name="DORD"/>
          <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR"/>
          <bitfield caption="Clock polarity" mask="0x08" name="CPOL"/>
          <bitfield caption="Clock Phase" mask="0x04" name="CPHA"/>
          <bitfield caption="SPI Clock Rate Selects" mask="0x03" name="SPR" values="COMM_SCK_RATE_3BIT"/>
        </register>
        <register caption="SPI Status Register" name="SPSR" offset="0x4D" size="1" ocd-rw="R">
          <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF"/>
          <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL"/>
          <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X"/>
        </register>
        <register caption="SPI Data Register" name="SPDR" offset="0x4E" size="1" ocd-rw="">
          <bitfield caption="SPI Data bits" mask="0xFF" name="SPD"/>
        </register>
      </register-group>
