sechshelme/Lazarus-Embedded/Tools/AVR_XML_to_Fuse_Const/XML/Atmel.ATmega_DFP.2.0.401.atpack_FILES/atdf/AT90PWM3.atdf
        <register caption="PSC 2 Input B Control" name="PFRC2A" offset="0xFC" size="1">
          <bitfield caption="PSC 2 Capture Enable Input Part A" mask="0x80" name="PCAE2A"/>
          <bitfield caption="PSC 2 Input Select for Part A" mask="0x40" name="PISEL2A"/>
          <bitfield caption="PSC 2 Edge Level Selector on Input Part A" mask="0x20" name="PELEV2A"/>
          <bitfield caption="PSC 2 Filter Enable on Input Part A" mask="0x10" name="PFLTE2A"/>
          <bitfield caption="PSC 2 Retrigger and Fault Mode for Part A" mask="0x0F" name="PRFM2A" values="PSC_FAULT_MODE_OPER"/>
        </register>
        <register caption="PSC 2 Control Register" name="PCTL2" offset="0xFB" size="1">
          <bitfield caption="PSC 2 Prescaler Selects" mask="0xC0" name="PPRE2" values="PSC_PRESCALER"/>
          <bitfield caption="Balance Flank Width Modulation" mask="0x20" name="PBFM2"/>
          <bitfield caption="PSC 2 Asynchronous Output Control B" mask="0x10" name="PAOC2B"/>
          <bitfield caption="PSC 2 Asynchronous Output Control A" mask="0x08" name="PAOC2A"/>
          <bitfield caption="PSC2 Auto Run" mask="0x04" name="PARUN2"/>
          <bitfield caption="PSC2 Complete Cycle" mask="0x02" name="PCCYC2"/>
          <bitfield caption="PSC 2 Run" mask="0x01" name="PRUN2"/>
        </register>
        <register caption="PSC 2 Configuration Register" name="PCNF2" offset="0xFA" size="1">
          <bitfield caption="PSC 2 Fifty" mask="0x80" name="PFIFTY2"/>
          <bitfield caption="PSC 2 Autolock" mask="0x40" name="PALOCK2"/>
          <bitfield caption="PSC 2 Lock" mask="0x20" name="PLOCK2"/>
          <bitfield caption="PSC 2 Mode" mask="0x18" name="PMODE2" values="PSC_ALIGN_MODE"/>
          <bitfield caption="PSC 2 Output Polarity" mask="0x04" name="POP2"/>
          <bitfield caption="PSC 2 Input Clock Select" mask="0x02" name="PCLKSEL2"/>
          <bitfield caption="PSC 2 Output Matrix Enable" mask="0x01" name="POME2"/>
        </register>
        <register caption="Output Compare 2 RB Register" name="OCR2RB" offset="0xF8" size="2">
          <bitfield caption="Output Compare RB" mask="0xFFFF" name="OCR2RB"/>
        </register>
        <register caption="Output Compare 2 SB Register" name="OCR2SB" offset="0xF6" size="2">
          <bitfield caption="Output Compare SB" mask="0x0FFF" name="OCR2SB"/>
        </register>
        <register caption="Output Compare 2 RA Register" name="OCR2RA" offset="0xF4" size="2">
          <bitfield caption="Output Compare RA" mask="0x0FFF" name="OCR2RA"/>
        </register>
        <register caption="Output Compare 2 SA Register" name="OCR2SA" offset="0xF2" size="2">
          <bitfield caption="Output Compare SA" mask="0x0FFF" name="OCR2SA"/>
        </register>
        <register caption="PSC 2 Output Matrix" name="POM2" offset="0xF1" size="1">
          <bitfield caption="Output Matrix Output B Ramps" mask="0xF0" name="POMV2B"/>
          <bitfield caption="Output Matrix Output A Ramps" mask="0x0F" name="POMV2A"/>
        </register>
        <register caption="PSC2 Synchro and Output Configuration" name="PSOC2" offset="0xF0" size="1">
          <bitfield caption="PSC 2 Output 23 Select" mask="0xC0" name="POS2" lsb="2"/>
          <bitfield caption="Synchronization Out for ADC Selection" mask="0x30" name="PSYNC2_"/>
          <bitfield caption="PSCOUT23 Output Enable" mask="0x08" name="POEN2D"/>
          <bitfield caption="PSCOUT21 Output Enable" mask="0x04" name="POEN2B"/>
          <bitfield caption="PSCOUT22 Output Enable" mask="0x02" name="POEN2C"/>
          <bitfield caption="PSCOUT20 Output Enable" mask="0x01" name="POEN2A"/>
        </register>
        <register caption="PSC2 Interrupt Mask Register" name="PIM2" offset="0xA5" size="1">
          <bitfield caption="PSC 2 Synchro Error Interrupt Enable" mask="0x20" name="PSEIE2"/>
          <bitfield caption="External Event B Interrupt Enable" mask="0x10" name="PEVE2B"/>
          <bitfield caption="External Event A Interrupt Enable" mask="0x08" name="PEVE2A"/>
          <bitfield caption="End of Cycle Interrupt Enable" mask="0x01" name="PEOPE2"/>
        </register>
        <register caption="PSC2 Interrupt Flag Register" name="PIFR2" offset="0xA4" size="1">
          <bitfield caption="PSC 2 Synchro Error Interrupt" mask="0x20" name="PSEI2"/>
          <bitfield caption="External Event B Interrupt" mask="0x10" name="PEV2B"/>
          <bitfield caption="External Event A Interrupt" mask="0x08" name="PEV2A"/>
          <bitfield caption="Ramp Number" mask="0x06" name="PRN2" values="MISC_2BIT_COUNT"/>
          <bitfield caption="End of PSC2 Interrupt" mask="0x01" name="PEOP2"/>
        </register>
      </register-group>
      <value-group name="PSC_FAULT_MODE_OPER">
        <value caption="No action, PSC Input is ignored" name="NO_ACTION_PSC_INPUT_IS_IGNORED" value="0x00"/>
        <value caption="Stop signal, Jump to Opposite Dead-Time and Wait" name="STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT" value="0x01"/>
        <value caption="Stop signal, Execute Opposite Dead-Time and Wait" name="STOP_SIGNAL_EXECUTE_OPPOSITE_DEAD_TIME_AND_WAIT" value="0x02"/>
        <value caption="Stop signal, Execute Opposite while Fault active" name="STOP_SIGNAL_EXECUTE_OPPOSITE_WHILE_FAULT_ACTIVE" value="0x03"/>
        <value caption="Deactivate outputs without changing timing." name="DEACTIVATE_OUTPUTS_WITHOUT_CHANGING_TIMING" value="0x04"/>
        <value caption="Stop signal and Insert Dead-Time" name="STOP_SIGNAL_AND_INSERT_DEAD_TIME" value="0x05"/>
        <value caption="Stop signal, Jump to Opposite Dead-Time and Wait." name="STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT" value="0x06"/>
        <value caption="Halt PSC and Wait for Software Action" name="HALT_PSC_AND_WAIT_FOR_SOFTWARE_ACTION" value="0x07"/>
        <value caption="Edge Retrigger PSC" name="EDGE_RETRIGGER_PSC" value="0x08"/>
        <value caption="Fixed Frequency Edge Retrigger PSC" name="FIXED_FREQUENCY_EDGE_RETRIGGER_PSC" value="0x09"/>
        <value caption="Reserved (do not use)" name="RESERVED_DO_NOT_USE" value="0x0A"/>
        <value caption="Reserved (do not use)" name="RESERVED_DO_NOT_USE" value="0x0B"/>
        <value caption="Reserved (do not use)" name="RESERVED_DO_NOT_USE" value="0x0C"/>
        <value caption="Reserved (do not use)" name="RESERVED_DO_NOT_USE" value="0x0D"/>
        <value caption="Fixed Frequency Edge Retrigger PSC and Disactivate Output" name="FIXED_FREQUENCY_EDGE_RETRIGGER_PSC_AND_DISACTIVATE_OUTPUT" value="0x0E"/>
        <value caption="Reserved (do not use)" name="RESERVED_DO_NOT_USE" value="0x0F"/>
      </value-group>
