sechshelme/Lazarus-Embedded/Tools/AVR_XML_to_Fuse_Const/XML/Atmel.ATmega_DFP.2.0.401.atpack_FILES/atdf/AT90PWM3.atdf
      <value-group name="PSC_PRESCALER">
        <value caption="No divider on PSC input clock" name="NO_DIVIDER_ON_PSC_INPUT_CLOCK" value="0x00"/>
        <value caption="Divide the PSC input clock by 4" name="DIVIDE_THE_PSC_INPUT_CLOCK_BY_4" value="0x01"/>
        <value caption="Divide the PSC input clock by 16" name="DIVIDE_THE_PSC_INPUT_CLOCK_BY_16" value="0x02"/>
        <value caption="Divide the PSC input clock by 64" name="DIVIDE_THE_PSC_INPUT_CLOCK_BY_64" value="0x03"/>
      </value-group>
      <value-group name="PSC_ALIGN_MODE">
        <value caption="One Ramp Mode" name="ONE_RAMP_MODE" value="0x00"/>
        <value caption="Two Ramp Mode" name="TWO_RAMP_MODE" value="0x01"/>
        <value caption="Four Ramp Mode" name="FOUR_RAMP_MODE" value="0x02"/>
        <value caption="Center Aligned Mode" name="CENTER_ALIGNED_MODE" value="0x03"/>
      </value-group>
      <value-group name="PSC_SYNC_SOURCE">
        <value caption="Send signal on leading edge of PSCOUTn0" name="SEND_SIGNAL_ON_LEADING_EDGE_OF_PSCOUTN0" value="0x00"/>
        <value caption="Send signal on trailing edge of PSCOUTn0" name="SEND_SIGNAL_ON_TRAILING_EDGE_OF_PSCOUTN0" value="0x01"/>
        <value caption="Send signal on leading edge of PSCOUTn1" name="SEND_SIGNAL_ON_LEADING_EDGE_OF_PSCOUTN1" value="0x02"/>
        <value caption="Send signal on trailing edge of PSCOUTn1" name="SEND_SIGNAL_ON_TRAILING_EDGE_OF_PSCOUTN1" value="0x03"/>
      </value-group>
      <value-group name="MISC_2BIT_COUNT">
        <value caption="1" name="1" value="0x00"/>
        <value caption="2" name="2" value="0x01"/>
        <value caption="3" name="3" value="0x02"/>
        <value caption="4" name="4" value="0x03"/>
      </value-group>
    </module>
  </modules>
</avr-tools-device-file>
